### Terraform `plan` Succeeded for Workspace: `prod`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_kms_alias.this will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/demo-kms-terraform-prod"
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # aws_kms_key.this will be created
+   resource "aws_kms_key" "this" {
+       arn                      = (known after apply)
+       customer_master_key_spec = "SYMMETRIC_DEFAULT"
+       deletion_window_in_days  = 10
+       description              = "Used to encrypt and decrypt the Terraform State S3 Bucket"
+       enable_key_rotation      = false
+       id                       = (known after apply)
+       is_enabled               = true
+       key_id                   = (known after apply)
+       key_usage                = "ENCRYPT_DECRYPT"
+       policy                   = (known after apply)
+       tags                     = {
+           "Environment" = "prod"
+           "Name"        = "demo-kms-teraform-prod"
+           "Source"      = "terraform"
        }
    }

  # aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = "private"
+       arn                         = (known after apply)
+       bucket                      = "demo-s3-terraform-prod"
+       bucket_domain_name          = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags                        = {
+           "Answer"      = "42"
+           "Environment" = "prod"
+           "Name"        = "demo-s3-terraform-prod"
+           "Source"      = "terraform"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       server_side_encryption_configuration {
+           rule {
+               apply_server_side_encryption_by_default {
+                   kms_master_key_id = (known after apply)
+                   sse_algorithm     = "aws:kms"
                }
            }
        }

+       versioning {
+           enabled    = true
+           mfa_delete = false
        }
    }

  # aws_s3_bucket_public_access_block.this will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>